In [2]:
import pandas as pd

In [3]:
cpi = pd.read_csv('CPILFESL.csv')

In [4]:
cci = pd.read_csv("USACSCICP02STSAM.csv")

In [5]:
cpi

    observation_date  CPILFESL
0         1957-01-01    28.500
1         1957-02-01    28.600
2         1957-03-01    28.700
3         1957-04-01    28.800
4         1957-05-01    28.800
..               ...       ...
820       2025-05-01   326.854
821       2025-06-01   327.600
822       2025-07-01   328.656
823       2025-08-01   329.793
824       2025-09-01   330.542

[825 rows x 2 columns]

In [6]:
cci

    observation_date  USACSCICP02STSAM
0         1960-01-01         107.59440
1         1960-02-01         105.19140
2         1960-03-01         102.78850
3         1960-04-01         100.38550
4         1960-05-01         101.78430
..               ...               ...
785       2025-06-01          65.30978
786       2025-07-01          66.38573
787       2025-08-01          62.61992
788       2025-09-01          59.28450
789       2025-10-01          57.67058

[790 rows x 2 columns]

In [7]:
index = pd.merge(cpi, cci, on='observation_date', how='inner')

In [8]:
index

    observation_date  CPILFESL  USACSCICP02STSAM
0         1960-01-01    30.500         107.59440
1         1960-02-01    30.600         105.19140
2         1960-03-01    30.600         102.78850
3         1960-04-01    30.600         100.38550
4         1960-05-01    30.600         101.78430
..               ...       ...               ...
784       2025-05-01   326.854          56.16426
785       2025-06-01   327.600          65.30978
786       2025-07-01   328.656          66.38573
787       2025-08-01   329.793          62.61992
788       2025-09-01   330.542          59.28450

[789 rows x 3 columns]